# Задача 30: Заполните массив элементами арифметической
# прогрессии. Её первый элемент, разность и количество
# элементов нужно ввести с клавиатуры. Формула для
# получения n-го члена прогрессии: a
# n
#  = a1
#  + (n-1) * d.
# Каждое число вводится с новой строки.

a, b, c = int(input()), int(input()), int(input())

for i in range(1,c+1):
    print(a)
    a += b

# ---------------------------------------------------------------------------------------------------------------------------------
# ---------------------------------------------------------------------------------------------------------------------------------
# ---------------------------------------------------------------------------------------------------------------------------------  

# Задача 32: Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону (т.е. не
# меньше заданного минимума и не больше заданного
# максимума)

li = [-5, 9, 0, 3, -1, -2, 1, \
4, -2, 10, 2, 0, -9, 8, 10, -9, \
0, -5, -5, 7]
x = 5
y = 15
li_2 = []

for i in range(0, len(li)):
    if li[i]>= x and li[i<=y]:
        li_2.append(i)

print(li_2)